
console.log('Підключено файл скриптів market.js')


let itemsDiv = document.getElementById("items");
// console.log(itemsDiv)

if (itemsDiv) {
    [
        'Газонокосарка 43',
        'Електричний тример 110',
        'Електрична газонокосарка 32',
        'Акумуляторний оприскувач 12 N',
        'Газонокосарка 430',
        'Електричний тример 130',
        'Електрична газонокосарка 320',
        'Акумуляторний оприскувач 12 E',
        'Газонокосарка 4303',
        'Електричний тример 1303',
        'Електрична газонокосарка 3203',
        'Акумуляторний оприскувач 12 E1',
    ].forEach((item, index) => {
        itemsDiv.innerHTML +=
        `
        <div class = "item">
        <h2>Товар№${index + 1 + ' з 12'}</h2>
        <p>${item}</p>
        </div>
        `
    })
    // console.log(itemsDiv)
    // console.log('Поле id: ', itemsDiv.id)
    // itemsDiv.innerHTML += '<div class = "item"></div>'
    // itemsDiv.innerHTML += '<div class = "item"></div>'
    // itemsDiv.innerHTML += '<div class = "item"></div>'
    // itemsDiv.innerHTML += '<div class = "item"></div>'
} else {
    console.log('Блок товарів не знайдено')
}
let itemsArray = ['Газонокосарка 43', '', '']
for (let i = 0; i < [
    'Газонокосарка 43',
    'Електричний тример 110',
    'Електрична газонокосарка 32',
    'Акумуляторний оприскувач 12 N',
    'Газонокосарка 430',
    'Електричний тример 130',
    'Електрична газонокосарка 320',
    'Акумуляторний оприскувач 12 E',
    'Газонокосарка 4303',
    'Електричний тример 1303',
    'Електрична газонокосарка 3203',
    'Акумуляторний оприскувач 12 E1',
].length; i++){
    console.log([
            'Газонокосарка 43',
            'Електричний тример 110',
            'Електрична газонокосарка 32',
            'Акумуляторний оприскувач 12 N',
            'Газонокосарка 430',
            'Електричний тример 130',
            'Електрична газонокосарка 320',
            'Акумуляторний оприскувач 12 E',
            'Газонокосарка 4303',
            'Електричний тример 1303',
            'Електрична газонокосарка 3203',
            'Акумуляторний оприскувач 12 E1',
        ][i])
}
// itemsArray.sort().forEach((item, index) => {
//     console.log(index + '-й елемент: ', item)
// })
// itemsArray = itemsArray.sort()
// console.log(itemsArray)

// for (let i = 0; i < itemsArray.length; i++){
//     console.log(i + '-й елемент: ', itemsArray[i])
// }